#字母預測:輸入a預測出b, 輸入b預測出c, 輸入c預測出d, 輸入d預測出e, 輸入e預測出a
#神經網絡的輸入都是數字,所有我們先把abcde五個字母用數字表示出來
# 用獨熱碼(one-hot)對他們編碼如下:
# a 100000
# b 010000
# c 000100
# d 000010
# e 000001

##################################################################計算結果和過程↓↓↓↓↓↓↓↓↓↓↓↓↓↓
# yt=[0.02, 0.02, 0.91, 0.03, 0.02 ]
# ↑
# ↑ by=[0.0, 0.1, 0.4, -0.7, 0.1]
# ↑ w(hy)=[[-1.7,0.7,-1.7,1.7,0.7], [-1.6,-1.6,0.7,1.3,1.4], [-1.4,1.9,1.2,1.7,-1.9]]
# ↑
# ht=[-0.9, 0.8, 0.7]   w(hh)=[[-0.9,-0.2,-0.4], [-0.3,0.9,0.2], [0.4,0.3,0.9]]
# ↑
# ↑ w(xh)=[[0.5,-1.7,1.7], [-2.3,0.8,1.1], [1.3,1.7,1.4], [0.3,0.8,-1.1], [-1.8,-2.0,-1.0]]
# ↑ bh=[0.5, 0.3, -0.2]
# ↑
# xt

# # h(t) = tanh( ( x(t)*w(xh) ) + ( h(t-1)*w(hh) ) + bh )
#        = tanh([-2.3 0.8 1.1] + 0 + [0.5 0.3 -0.2]) #上一時刻也就是最開始時記憶體狀態信息等於0,所以加上0
#        = tanh[-1.8 1.1 0.9]
#        = [-0.9 0.8 0.7] #得到當前時刻的狀態信息h(t) #記憶體存儲的狀態信息被刷新為[-0.9 0.8 0.7],這個過程你可以理解為腦中的記憶因為當前輸入的事物而更新了

# # y(t) = softmax((h(t) * w(hy)) + by) #y(t)就是把提取到的時間信息,通過全連接進行識別預測的過程,是整個網絡的輸出層
#        = softmax([-0.7 -0.6 2.9 0.7 -0.8] + [0.0, 0.1, 0.4, -0.7, 0.1])
#        = softmax([-0.7 -0.5 3.3 0.0 -0.7])
#        = [0.02 0.02 0.91 0.03 0.02] #模型認為有91%的可能性輸出字母c